### 1、GroupBy机制

In [4]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],'key2' : ['one', 'two', 'one', 'two', 'one'],'data1' : np.random.randn(5),'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.711448  0.433594
1    a  two  1.328378 -1.012304
2    b  one -0.068565 -0.202354
3    b  two  1.137191  0.628250
4    a  one -0.784152  0.050050

In [5]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [6]:
grouped.mean()

key1
a    0.418558
b    0.534313
Name: data1, dtype: float64

In [9]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()
means

key1  key2
a     one    -0.036352
      two     1.328378
b     one    -0.068565
      two     1.137191
Name: data1, dtype: float64

In [10]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -0.036352  0.241822
     two   1.328378 -1.012304
b    one  -0.068565 -0.202354
     two   1.137191  0.628250

In [11]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [12]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.711448  0.433594
1    a  two  1.328378 -1.012304
4    a  one -0.784152  0.050050
b
  key1 key2     data1     data2
2    b  one -0.068565 -0.202354
3    b  two  1.137191  0.628250

In [13]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.711448  0.433594
4    a  one -0.784152  0.050050
('a', 'two')
  key1 key2     data1     data2
1    a  two  1.328378 -1.012304
('b', 'one')
  key1 key2     data1     data2
2    b  one -0.068565 -0.202354
('b', 'two')
  key1 key2     data1    data2
3    b  two  1.137191  0.62825

In [14]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [15]:
grouped = df.groupby(df.dtypes,axis=1)
for dtype,group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  0.711448  0.433594
1  1.328378 -1.012304
2 -0.068565 -0.202354
3  1.137191  0.628250
4 -0.784152  0.050050
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [16]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.241822
     two  -1.012304
b    one  -0.202354
     two   0.628250

In [19]:
people = pd.DataFrame(np.random.randn(5, 5),
   ....:                       columns=['a', 'b', 'c', 'd', 'e'],
   ....:                       index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values
people

               a         b         c         d         e
Joe    -1.001270 -1.026252  1.082809 -2.215030  1.219558
Steve  -0.498780  1.093323 -0.157008 -1.409615  0.611382
Wes    -0.266671       NaN       NaN -1.506419 -1.071718
Jim     0.272013 -1.245769  0.940844  0.054660 -0.819209
Travis -0.149889 -1.452411 -0.562824 -0.117387  0.594554

In [20]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
   ....:            'd': 'blue', 'e': 'red', 'f' : 'orange'}
by_column = people.groupby(mapping,axis=1)
by_column.sum()

            blue       red
Joe    -1.132222 -0.807964
Steve  -1.566623  1.205924
Wes    -1.506419 -1.338390
Jim     0.995504 -1.792965
Travis -0.680211 -1.007746

In [22]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [23]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [24]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.995929 -2.272021  2.023653 -3.666789 -0.671369
5 -0.498780  1.093323 -0.157008 -1.409615  0.611382
6 -0.149889 -1.452411 -0.562824 -0.117387  0.594554

In [25]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
   ....:                                     [1, 3, 5, 1, 3]],
   ....:                                     names=['cty', 'tenor'])
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.016745  0.003483  0.571549 -0.999876  1.994657
1      0.421542 -0.731992 -1.155224 -0.083674 -0.690651
2     -0.730499  1.383329  0.306489 -1.746692 -1.862813
3     -0.348215  0.295827 -1.612945 -1.076230  1.922766

In [26]:
hier_df.groupby(level='cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

### 2、数据聚合

In [27]:
df

  key1 key2     data1     data2
0    a  one  0.711448  0.433594
1    a  two  1.328378 -1.012304
2    b  one -0.068565 -0.202354
3    b  two  1.137191  0.628250
4    a  one -0.784152  0.050050

In [28]:
grouped = df.groupby('key1')
grouped['data1'].quantile(0.9)

key1
a    1.204992
b    1.016616
Name: data1, dtype: float64

In [29]:
def peak_to_peak(arr):
   ....:     return arr.max() - arr.min()
grouped.agg(peak_to_peak)

E:\anaconda\lib\site-packages\pandas\core\groupby\generic.py:303: FutureWarning: Dropping invalid columns in SeriesGroupBy.agg is deprecated. In a future version, a TypeError will be raised. Before calling .agg, select only columns which should be valid for the aggregating function.
  results[key] = self.aggregate(func)

         data1     data2
key1
a     2.112529  1.445898
b     1.205757  0.830603

In [30]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.418558  1.086293 -0.784152 -0.036352  0.711448  1.019913
b      2.0  0.534313  0.852599 -0.068565  0.232874  0.534313  0.835752

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.328378   3.0 -0.176220  0.749035 -1.012304 -0.481127  0.050050
b     1.137191   2.0  0.212948  0.587325 -0.202354  0.005297  0.212948


           75%       max
key1
a     0.241822  0.433594
b     0.420599  0.628250

### 3、一般性的“拆分-应用-合并”

In [31]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
   ....:                       'data2': np.random.randn(1000)})
frame

        data1     data2
0   -1.049700 -0.745819
1   -0.344267  0.653765
2   -0.985902  0.634784
3   -0.999103 -1.107551
4    0.397679  0.111871
..        ...       ...
995  2.356709 -1.313445
996  0.775725  1.312744
997  0.910579 -0.179929
998 -0.314239  0.679553
999 -0.615086 -1.947359

[1000 rows x 2 columns]

In [32]:
quartiles = pd.cut(frame.data1,4)
quartiles[:10]

0    (-1.412, 0.347]
1    (-1.412, 0.347]
2    (-1.412, 0.347]
3    (-1.412, 0.347]
4     (0.347, 2.105]
5     (0.347, 2.105]
6    (-1.412, 0.347]
7    (-1.412, 0.347]
8    (-1.412, 0.347]
9    (-1.412, 0.347]
Name: data1, dtype: category
Categories (4, interval[float64, right]): [(-3.178, -1.412] < (-1.412, 0.347] < (0.347, 2.105] < (2.105, 3.864]]

In [33]:
def get_stats(group):
   ....:     return {'min': group.min(), 'max': group.max(),
   ....:             'count': group.count(), 'mean': group.mean()}
grouped = frame.data2.groupby(quartiles)
grouped.apply(get_stats).unstack()

                       min       max  count      mean
data1
(-3.178, -1.412] -1.787617  2.567631   78.0  0.029552
(-1.412, 0.347]  -3.065313  2.692914  547.0 -0.005591
(0.347, 2.105]   -2.600393  3.148339  356.0  0.118531
(2.105, 3.864]   -1.542018  1.421516   19.0  0.040354

In [34]:
grouping = pd.qcut(frame.data1,10,labels=False)
grouped = frame.data2.groupby(grouping)
grouped.apply(get_stats).unstack()

            min       max  count      mean
data1
0     -1.881892  2.567631  100.0  0.033097
1     -2.530269  2.615261  100.0  0.041073
2     -3.065313  2.677262  100.0  0.054503
3     -2.058444  2.334730  100.0 -0.085645
4     -2.530510  2.573324  100.0 -0.027247
5     -2.297833  2.692914  100.0 -0.009988
6     -2.582247  2.740378  100.0  0.023705
7     -2.600393  2.739912  100.0  0.087577
8     -2.116983  2.098335  100.0  0.141166
9     -1.932793  3.148339  100.0  0.163863

In [35]:
s = pd.Series(np.random.randn(6))
s[::2] = np.nan
s

0         NaN
1    0.100893
2         NaN
3   -0.574520
4         NaN
5   -1.009867
dtype: float64

In [37]:
s.fillna(s.mean())

0   -0.494498
1    0.100893
2   -0.494498
3   -0.574520
4   -0.494498
5   -1.009867
dtype: float64

In [38]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
   ....:           'Oregon', 'Nevada', 'California', 'Idaho']
group_key = ['East'] * 4 + ['West'] * 4
data = pd.Series(np.random.randn(8), index=states)
data

Ohio         -0.231470
New York      1.151249
Vermont       0.327429
Florida       1.209368
Oregon        0.087723
Nevada       -1.300909
California   -1.848435
Idaho         0.691740
dtype: float64

In [40]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data

Ohio         -0.231470
New York      1.151249
Vermont            NaN
Florida       1.209368
Oregon        0.087723
Nevada             NaN
California   -1.848435
Idaho              NaN
dtype: float64

In [41]:
data.groupby(group_key).mean()

East    0.709716
West   -0.880356
dtype: float64

In [42]:
fill_mean = lambda g:g.fillna(g.mean())
data.groupby(group_key).apply(fill_mean)

Ohio         -0.231470
New York      1.151249
Vermont       0.709716
Florida       1.209368
Oregon        0.087723
Nevada       -0.880356
California   -1.848435
Idaho        -0.880356
dtype: float64

In [43]:
fill_values = {'East':0.5,'West':-1}
fill_func = lambda g:g.fillna(fill_values[g.name])
data.groupby(group_key).apply(fill_func)

Ohio         -0.231470
New York      1.151249
Vermont       0.500000
Florida       1.209368
Oregon        0.087723
Nevada       -1.000000
California   -1.848435
Idaho        -1.000000
dtype: float64

In [44]:
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)

deck = pd.Series(card_val, index=cards)
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [45]:
def draw(deck,n=5):
    return deck.sample(n)
draw(deck)

JD    10
3H     3
7D     7
8S     8
8H     8
dtype: int64

In [46]:
get_suit = lambda card:card[-1]
deck.groupby(get_suit).apply(draw,2)

C  6C     6
   7C     7
D  5D     5
   JD    10
H  QH    10
   3H     3
S  6S     6
   9S     9
dtype: int64

In [47]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
   .....:                                 'b', 'b', 'b', 'b'],
   .....:                    'data': np.random.randn(8),
   .....:                    'weights': np.random.rand(8)})
df

  category      data   weights
0        a -0.365344  0.218488
1        a -0.788353  0.035391
2        a -1.471748  0.110037
3        a  0.452073  0.254427
4        b  0.319988  0.720303
5        b -0.375040  0.325914
6        b -0.757439  0.334706
7        b  1.692842  0.864786

In [48]:
grouped = df.groupby('category')
get_wavg = lambda g:np.average(g['data'],weights=g['weights'])
grouped.apply(get_wavg)

category
a   -0.250106
b    0.587202
dtype: float64

### 4、透视表和交叉表